package pworkers

import (
	"fmt"
	"math/rand"
	"sync"
	"time"
)

func PWorkers() {

	wg := sync.WaitGroup{}

	jobs := make(chan int, 100)
	result := make(chan int, 100)

	for range 100 {

		jobs <- rand.Intn(10)

	}

	close(jobs)

	for range 3 {

		wg.Add(1)

		go worker(jobs, result, &wg)
	}

	go func() {
		wg.Wait()
		close(result)
	}()

	for i := range result {

		fmt.Println(i)
	}
}

func worker(jobs chan int, result chan int, wg *sync.WaitGroup) {
	defer wg.Done()

	for val := range jobs {

		time.Sleep(2 * time.Second)

		result <- val * 2
	}
}

// Вот в чём разница: вы представляете канал как слайс/массив (или книгу), а на самом деле канал — это автомат с талончиками в банке!

// Разница между Слайсом ([]int) и Каналом (chan int)
// Если бы вы передали слайс []int{1, 2, 3, 4}: Вы правы! Каждая горутина прочитала бы всё от начала до конца:

// Воркер 1 прочитает: 1, 2, 3, 4
// Воркер 2 прочитает: 1, 2, 3, 4
// Воркер 3 прочитает: 1, 2, 3, 4
// Но вы передали Канал (chan int): Канал в Go — это безопасная очередь в памяти. Как только элемент прочитан из канала, он ИСЧЕЗАЕТ из канала навсегда.

// 🎬 Пошаговый разбор (как это происходит в памяти):
// Допустим, в канале jobs лежат числа: [1, 2, 3, 4, 5, 6].

// Секунда 0.00:

// Воркер 1 заходит в for val := range jobs. Go выдает ему число 1 и СРАЗУ УДАЛЯЕТ 1 ИЗ КАНАЛА. В канале осталось: [2, 3, 4, 5, 6]. Воркер 1 уходит спать на 2 секунды, обрабатывая число 1.
// Секунда 0.001:

// Воркер 2 заходит в for val := range jobs. Числа 1 в канале уже НЕТ! Go выдает ему число 2 и УДАЛЯЕТ 2 ИЗ КАНАЛА. В канале осталось: [3, 4, 5, 6]. Воркер 2 уходит спать на 2 секунды, обрабатывая число 2.
// Секунда 0.002:

// Воркер 3 заходит в for val := range jobs. Чисел 1 и 2 уже нет! Go выдает ему число 3 и УДАЛЯЕТ 3 ИЗ КАНАЛА. В канале осталось: [4, 5, 6]. Воркер 3 уходит спать на 2 секунды, обрабатывая число 3.
// Секунда 2.00:

// Воркер 1 проснулся, закончил работу с числом 1 и снова запрашивает число из канала.
// Go выдает ему первое доступное число — 4, и УДАЛЯЕТ 4 ИЗ КАНАЛА. В канале осталось: [5, 6].
// Итоговое распределение:
// Воркер 1 обработает: 1, 4, 7...
// Воркер 2 обработает: 2, 5, 8...
// Воркер 3 обработает: 3, 6, 9...
// Ни одно число не будет обработано дважды, потому что чтение из канала val := <-jobs — это операция извлечения (pop), а не просто просмотр!

// Внутренне рантайм Go сам ставит блокировку (mutex), когда горутина забирает элемент из канала, чтобы две горутины ни в коем случае не смогли вытащить одно и то же число.
